Masmiseim36/nxpSDK/boards/frdmke16z/demo_apps/touch_sensing/pin_mux.h
/*
 * Copyright 2019 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name PORTB1 (number 26), UART0_TX_TGTMCU
  @{ */
#define BOARD_DEBUG_UART_TX_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_DEBUG_UART_TX_PIN 1U     /*!<@brief PORTB pin index: 1 */
                                       /* @} */

/*! @name PORTB0 (number 27), UART0_RX_TGTMCU
  @{ */
#define BOARD_DEBUG_UART_RX_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_DEBUG_UART_RX_PIN 0U     /*!<@brief PORTB pin index: 0 */
                                       /* @} */

/*! @name PORTB5 (number 15), D4[1]/RGB_RED
  @{ */
#define BOARD_LED_RED_PERIPHERAL                                            FTM0   /*!< Device name: FTM0 */
#define BOARD_LED_RED_SIGNAL                                                  CH   /*!< FTM0 signal: CH */
#define BOARD_LED_RED_CHANNEL                                                  5   /*!< FTM0 channel: 5 */
#define BOARD_LED_RED_PIN_NAME                                          FTM0_CH5   /*!< Pin name */
#define BOARD_LED_RED_LABEL                                      "D4[1]/RGB_RED"   /*!< Label */
#define BOARD_LED_RED_NAME                                             "LED_RED"   /*!< Identifier name */

/*! @name PORTB4 (number 16), D4[4]/RGB_GREEN
  @{ */
#define BOARD_LED_GREEN_PERIPHERAL                                          FTM0   /*!< Device name: FTM0 */
#define BOARD_LED_GREEN_SIGNAL                                                CH   /*!< FTM0 signal: CH */
#define BOARD_LED_GREEN_CHANNEL                                                4   /*!< FTM0 channel: 4 */
#define BOARD_LED_GREEN_PIN_NAME                                        FTM0_CH4   /*!< Pin name */
#define BOARD_LED_GREEN_LABEL                                  "D4[4]/RGB_GREEN"   /*!< Label */
#define BOARD_LED_GREEN_NAME                                         "LED_GREEN"   /*!< Identifier name */

/*! @name PORTD1 (number 1), D4[3]/RGB_BLUE
  @{ */
#define BOARD_LED_BLUE_PERIPHERAL                                           FTM0   /*!< Device name: FTM0 */
#define BOARD_LED_BLUE_SIGNAL                                                 CH   /*!< FTM0 signal: CH */
#define BOARD_LED_BLUE_CHANNEL                                                 3   /*!< FTM0 channel: 3 */
#define BOARD_LED_BLUE_PIN_NAME                                         FTM0_CH3   /*!< Pin name */
#define BOARD_LED_BLUE_LABEL                                    "D4[3]/RGB_BLUE"   /*!< Label */
#define BOARD_LED_BLUE_NAME                                           "LED_BLUE"   /*!< Identifier name */

/*! @name PORTB1 (number 26), UART0_TX_TGTMCU
  @{ */
#define BOARD_DEBUG_UART_TX_PERIPHERAL                                   LPUART0   /*!< Device name: LPUART0 */
#define BOARD_DEBUG_UART_TX_SIGNAL                                            TX   /*!< LPUART1 signal: TX */
#define BOARD_DEBUG_UART_TX_PIN_NAME                                  LPUART0_TX   /*!< Pin name */
#define BOARD_DEBUG_UART_TX_LABEL                              "UART0_TX_TGTMCU"   /*!< Label */
#define BOARD_DEBUG_UART_TX_NAME                                 "DEBUG_UART_TX"   /*!< Identifier name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
